Revit 2027 API
Wood.WoodColor2 Property
 The property labeled "Color 2" from the "Wood" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string WoodColor2 { get; }
Public Shared ReadOnly Property WoodColor2 As String
	Get
public:
static property String^ WoodColor2 {
	String^ get ();
}
static member WoodColor2 : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyDoubleArray4d". This property allows a connected asset.
See Also
Reference
Wood Class
Autodesk.Revit.DB.Visual Namespace